app/controllers/api/projects_controller.rb

SELECT "projects".* FROM "projects"
---
      def index
            @projects = Project.all

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "projects" SET "projectname" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["projectname", "Bitbucket"], ["updated_at", 2017-02-27 10:23:20 UTC], ["id", 2]]
---
          def update
          @project = Project.find(params[:id])
            if @project.update(project_params)