app/controllers/api/projections_controller.rb

SELECT "projections".* FROM "projections"
---
def index
  @projections= Projection.all