app/views/projects/index.html.erb

        <td>
            <% if (User.where(id: project.project_lead).empty?) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "users" WHERE "users"."id" = ?  [["id", 4]]

<% if (current_user.isadmin == true || current_user.ismanagement == true || current_user.id == project.project_manager || current_user.id== project.project_lead ) %>
    <% timesheets= Timesheet.select{|a| a.project_id == project.id } %>
---
SELECT "timesheets".* FROM "timesheets"

        <td class="pull-right">
          <% if (Projection.find_by(project_id: project.id, user_id: current_user.id).nil?) %>
---
SELECT  "projections".* FROM "projections" WHERE "projections"."project_id" = ? AND "projections"."user_id" = ? LIMIT ?  [["project_id", 1], ["user_id", 1], ["LIMIT", 1]]