app/views/projects/show.html.erb

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "users" WHERE "users"."id" = ?  [["id", 4]]
---
        <td>
            <% if (User.where(id: @project.project_lead).empty?) %>

SELECT "timesheets".* FROM "timesheets"
---
<% if (current_user.isadmin == true || current_user.ismanagement == true || current_user.is_project_manager== true || current_user.is_project_lead== true ) %>
    <% timesheets= Timesheet.select{|a| a.project_id == @project.id } %>

SELECT "tasks"."task_category" FROM "tasks"
---

<% cat= Task.all.pluck(:task_category).uniq %>

SELECT "tasks".* FROM "tasks"
---
          <li class="list-group-item">
            <% mytimesheets= @timesheets.select{|a| a.task_id ==  task.id} %>