app/controllers/projects_controller.rb

SELECT  "projects".* FROM "projects" ORDER BY created_at DESC LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
---
  def index

  @projects = Project.order('created_at DESC').paginate(:page => params[:page])