app/controllers/projects_controller.rb

  def index

  @projects = Project.where(:is_active => true).order('created_at DESC').paginate(:page => params[:page])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."is_active" = ? ORDER BY created_at DESC LIMIT ? OFFSET ?  [["is_active", true], ["LIMIT", 10], ["OFFSET", 0]]

  def show
    @project = Project.find(params[:id])
    if(current_user.isadmin == true || current_user.ismanagement == true || current_user.id == @project.project_manager || current_user.id== @project.project_lead )
      @timesheets= Timesheet.select{|a| a.project_id == @project.id }
    else
      @timesheets= Timesheet.select{|a| a.project_id== @project.id && a.user_id == current_user.id}
    end

    @tasks= Task.all
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "timesheets".* FROM "timesheets"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks"

  def new
    @users= User.all
---
SELECT "users".* FROM "users"

  def edit
    @project = Project.find(params[:id])
    @users= User.all
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "users".* FROM "users"

  def create
        @users= User.all
        @projectmanagers=User.select {|a| a.is_project_manager == true}
        @projectleads= User.select {|a| a.is_project_lead == true}
    @project = Project.new(project_params)
    @project.is_active= true
      if @project.save
---
SELECT "users".* FROM "users"
INSERT INTO "projects" ("jobid", "projectname", "clientname", "startdate", "projectstatus", "created_at", "updated_at", "sbu", "project_lead", "project_manager", "is_active", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
  @project = Project.find(params[:id])
    if @project.update(project_params)
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "projects" SET "projectstatus" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["projectstatus", "Ongoing"], ["updated_at", 2017-02-23 12:02:11 UTC], ["id", 6]]

def manage
  @project = Project.find(params[:id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

def destroy
  @project = Project.find(params[:id])
  Project.update(params[:id], :is_active => false )
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "projects" SET "is_active" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["is_active", false], ["updated_at", 2017-02-27 10:28:57 UTC], ["id", 1]]