app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks"
SELECT "timesheets".* FROM "timesheets"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users"
---
  def index
      #@tasks = Task.all
      @tasks = Task.all
      if (current_user.isadmin == true || current_user.ismanagement == true)
        @timesheets= Timesheet.all
      elsif (current_user.is_project_manager== true || current_user.is_project_lead== true )
        @timesheets= Timesheet.select{|a| current_user.id == Project.find(a.project_id).project_lead || current_user.id == Project.find(a.project_id).project_manager || current_user.id == a.user_id }
      else
        @timesheets= Timesheet.select{|a| a.user_id== current_user.id}

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users"
---
  def show
      @task = Task.find(params[:id])
      if (current_user.isadmin == true || current_user.ismanagement == true || current_user.is_project_manager== true || current_user.is_project_lead== true )
        @timesheets= Timesheet.all
      else
        @timesheets= Timesheet.select{|a| a.user_id== current_user.id}

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @task= Task.find(params[:id])

INSERT INTO "tasks" ("taskname", "created_at", "updated_at", "task_category") VALUES (?, ?, ?, ?)  [["taskname", "Meeting with Client"], ["created_at", 2017-02-16 05:59:02 UTC], ["updated_at", 2017-02-16 05:59:02 UTC], ["task_category", "Proposal"]]
---
def create
  @task = Task.new(task_params)
    if @task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 60], ["LIMIT", 1]]
UPDATE "tasks" SET "taskname" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["taskname", "Recruitment"], ["updated_at", 2017-02-21 09:04:10 UTC], ["id", 60]]
---
def update
  @task = Task.find(params[:id])
    if @task.update(task_params)