app/controllers/timesheets_controller.rb

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "projects".* FROM "projects"
SELECT "timesheets".* FROM "timesheets"
SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "projects" WHERE "projects"."is_active" = ?  [["is_active", true]]
SELECT "tasks".* FROM "tasks"
---
def index
#@timesheets= Timesheet.all.order("created_at DESC")
if (current_user.isadmin == true || current_user.ismanagement == true )
  @timesheets = Timesheet.select{|a| Project.find(a.project_id).is_active == true }
elsif (current_user.is_project_manager == true || current_user.is_project_lead== true )

  @timesheets= Timesheet.select{|a|  (Project.find(a.project_id).project_lead == current_user.id ||  Project.find(a.project_id).project_manager == current_user.id ||  a.user_id == current_user.id) && Project.find(a.project_id).is_active == true }
else
  @timesheets= Timesheet.select{|a| a.user_id == current_user.id && Project.find(a.project_id).is_active == true }
end
if (!@timesheets.empty?)
  @timesheets= @timesheets .sort_by { |h| h[:created_at]}.reverse
end
  @users= User.all
  @projects = Project.where(:is_active => true)
  @tasks= Task.all

SELECT  "timesheets".* FROM "timesheets" WHERE "timesheets"."id" = ? LIMIT ?  [["id", 3000001], ["LIMIT", 1]]
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "timesheets".* FROM "timesheets"
---
def show
  @timesheet = Timesheet.find(params[:id])
@timesheets= Timesheet.select{|a| a.project_id== @timesheet.project_id && a.task_id== @timesheet.task_id && a.user_id == @timesheet.user_id}

SELECT "projections".* FROM "projections"
SELECT "users".* FROM "users"
SELECT "tasks".* FROM "tasks"
---
def new
@projects=Projection.select {|a| a.user_id == current_user.id}
@tasks= Task.all

SELECT "timesheets".* FROM "timesheets"
INSERT INTO "timesheets" ("id", "created_at", "updated_at", "project_id", "task_id", "Tdate", "timespent", "feeling", "user_id", "totaltasktime") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
def create
  @timesheet = Timesheet.new(timesheet_params)
  @mytimesheets= Timesheet.select {|a| (a.project_id == @timesheet.project_id) && (a.task_id == @timesheet.task_id)&& (a.user_id == @timesheet.user_id)}.pluck(:timespent)
  if(@mytimesheets.empty? && !params[:timesheet][:timespent].empty?)
        @timesheet.totaltasktime = @timesheet.timespent
 elsif (!params[:timesheet][:timespent].empty?)
         @timesheet.totaltasktime = @timesheet.timespent + (@mytimesheets.inject{|sum,x| sum +x})
  end
   # render json: @timesheet
    if @timesheet.save

SELECT "projects".* FROM "projects"
SELECT "tasks".* FROM "tasks"
---
def pipeline
  @projects = Project.select{|p| p.projectstatus== "Pipeline"}
  @tasks= Task.select{|t| t.task_category== "Proposal"}