app/controllers/users_controller.rb

SELECT  "users".* FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
---
def index
  @users = User.paginate(:page => params[:page])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
def edit
  @user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "designation" = ?, "is_project_lead" = ?, "weight" = ?, "approved" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["designation", "Senior Research Manager (SRM)"], ["is_project_lead", true], ["weight", 3.0], ["approved", true], ["updated_at", 2017-02-16 09:48:37 UTC], ["id", 4]]
---
def update
  @user = User.find(params[:id])
  if @user.update(user_params)